## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.databricks.databricks_cluster.demo-cluster will be created
  + resource "databricks_cluster" "demo-cluster" {
      + autotermination_minutes      = 30
      + cluster_id                   = (known after apply)
      + cluster_name                 = "demo-cluster"
      + cluster_source               = (known after apply)
      + data_security_mode           = "NONE"
      + default_tags                 = (known after apply)
      + driver_instance_pool_id      = (known after apply)
      + driver_node_type_id          = (known after apply)
      + enable_elastic_disk          = (known after apply)
      + enable_local_disk_encryption = (known after apply)
      + id                           = (known after apply)
      + node_type_id                 = "Standard_DS3_v2"
      + num_workers                  = 0
      + policy_id                    = "0007302AE31343DE"
      + runtime_engine               = "PHOTON"
      + spark_version                = "15.4.x-cpu-ml-scala2.12"
      + state                        = (known after apply)
      + url                          = (known after apply)

      + autoscale {
          + max_workers = 2
          + min_workers = 1
        }

      + azure_attributes {
          + availability       = "SPOT_WITH_FALLBACK_AZURE"
          + first_on_demand    = 1
          + spot_bid_max_price = -1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>